{
    "type": "file",
    "exchangeType": "file-based",
    "mediumType": "[csv-file,json-file,xml-file,geojson-file,Excel-file]",

    "name":"fixed-format",
    "displayName": "Fixed format (csv, xml, json, ..)",
    "schema": "[comma seperated field list,XSD,json scheme]",
    "schemaUrl": "[url of the XSD or json scheme]",
    "fieldList": "[comma seperated field list]",
    "csvSeperationToken": "[comma,semi-colon,space,tab,not-applicable]",

    "url": "[complete url]",
    "refreshRate": "[ISO8601 timespan]",

    "privacy": "*",
    "confidentiality": "*",
    "interoperability": "E",
    "domain": "E",
    "retentionPeriod": "[ISO8601 timespan]",
    "bbversion": 1,

    "aggregationOperator": "[AVG, COUNT, MAX, MIN, MED, SUM, 75PERCENTILE, 80PERCENTILE, 85PERCENTILE, 90PERCENTILE, 95PERCENTILE, 99PERCENTILE]",
    "timeUnit": "[minute, quarter_of_hour, hour, daypart, day, week, month, year]",
    "timeAmount": "[measurement period]",
    "geoUnit": "[postal, postal1_4, district, city, region, custom]",
    "geoUnitCustomSpecification": "[URL of the spatial areas (geojson, shapefile, etc)]",
    "description": "<b>A separated values (CSV) file</b> is a delimited text file that uses a comma to separate values. Each line of the file is a data record. Each record consists of one or more fields, separated by commas. The use of the comma as a field separator is the source of the name for this file format. A CSV file typically stores tabular data (numbers and text) in plain text, in which case each line will have the same number of fields.<br><b>GeoJSON</b> is an open standard format designed for representing simple geographical features, along with their non-spatial attributes. It is based on the JSON format.<br><b>JSON (JavaScript Object Notation)</b> is an open standard file format and data interchange format that uses human-readable text to store and transmit data objects consisting of attribute–value pairs and arrays (or other serializable values). It is a common data format with diverse uses in electronic data interchange, including that of web applications with servers.<br><b>Extensible Markup Language (XML)</b> is a markup language and file format for storing, transmitting, and reconstructing arbitrary data. It defines a set of rules for encoding documents in a format that is both human-readable and machine-readable"
}